In [2]:
import pandas as pd

In [2]:
chicago = pd.read_csv("../data/chicago.csv")
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [3]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null object
Employee Annual Salary    32062 non-null object
dtypes: object(4)
memory usage: 1002.0+ KB

In [4]:
chicago["Department"].unique()

array(['WATER MGMNT', 'POLICE', 'GENERAL SERVICES', 'CITY COUNCIL',
       'STREETS & SAN', 'OEMC', 'AVIATION', 'FIRE', 'FAMILY & SUPPORT',
       'IPRA', 'PUBLIC LIBRARY', 'BUSINESS AFFAIRS', 'TRANSPORTN',
       'HEALTH', "MAYOR'S OFFICE", 'LAW', 'FINANCE', 'CULTURAL AFFAIRS',
       'COMMUNITY DEVELOPMENT', 'BUILDINGS', 'ANIMAL CONTRL',
       'CITY CLERK', 'BOARD OF ELECTION', 'INSPECTOR GEN', 'TREASURER',
       'DISABILITIES', 'HUMAN RESOURCES', 'DoIT', 'BUDGET & MGMT',
       'PROCUREMENT', 'HUMAN RELATIONS', 'BOARD OF ETHICS',
       'POLICE BOARD', 'ADMIN HEARNG', 'LICENSE APPL COMM', nan],
      dtype=object)

In [5]:
chicago["Department"].nunique()

35

In [6]:
chicago["Department"] = chicago["Department"].astype("category")

In [7]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 784.4+ KB

### Common String methods - .lower(), .upper(), .title() and .len()

In [14]:
chicago = pd.read_csv("../data/chicago.csv").dropna(how="all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [15]:
"Hello World".lower()

'hello world'

In [16]:
"hello world".upper()

'HELLO WORLD'

In [17]:
"hello world".title()

'Hello World'

In [18]:
chicago["Name"] = chicago["Name"].str.title()
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
2,"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
3,"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [19]:
chicago["Position Title"] = chicago["Position Title"].str.title()
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MGMNT,$90744.00
1,"Aaron, Jeffery M",Police Officer,POLICE,$84450.00
2,"Aaron, Karina",Police Officer,POLICE,$84450.00
3,"Aaron, Kimberlei R",Chief Contract Expediter,GENERAL SERVICES,$89880.00
4,"Abad Jr, Vicente M",Civil Engineer Iv,WATER MGMNT,$106836.00

In [20]:
chicago["Department"].str.len()

0        11
1         6
2         6
3        16
4        11
5        12
6        13
7         4
8        12
9         8
10        4
11        6
12       16
13        6
14        4
15        6
16        6
17        4
18        6
19        4
20       11
21        4
22        4
23        4
24       16
25       11
26       13
27       16
28        6
29        4
         ..
32032    16
32033     6
32034     6
32035     6
32036    13
32037     4
32038    11
32039     4
32040     6
32041     4
32042    16
32043    13
32044     6
32045     4
32046     7
32047     6
32048     3
32049     4
32050    11
32051     8
32052     6
32053     4
32054     6
32055     6
32056    16
32057    16
32058     6
32059     6
32060     6
32061     4
Name: Department, Length: 32062, dtype: int64

### The .str.replace() Method

In [21]:
"Hello World".replace("l", "!")

'He!!o Wor!d'

In [22]:
chicago.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"Zygadlo, Michael J",Frm Of Machinists - Automotive,GENERAL SERVICES,$99528.00
32058,"Zygowicz, Peter J",Police Officer,POLICE,$87384.00
32059,"Zymantas, Mark E",Police Officer,POLICE,$84450.00
32060,"Zyrkowski, Carlo E",Police Officer,POLICE,$87384.00
32061,"Zyskowski, Dariusz",Chief Data Base Analyst,DoIT,$113664.00

In [27]:
chicago["Department"] = chicago["Department"].str.replace("MGMNT", "MANAGEMENT")
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MANAGEMENT,$90744.00
1,"Aaron, Jeffery M",Police Officer,POLICE,$84450.00
2,"Aaron, Karina",Police Officer,POLICE,$84450.00
3,"Aaron, Kimberlei R",Chief Contract Expediter,GENERAL SERVICES,$89880.00
4,"Abad Jr, Vicente M",Civil Engineer Iv,WATER MANAGEMENT,$106836.00

In [30]:
chicago["Employee Annual Salary"] = chicago["Employee Annual Salary"].str.replace("$", "").astype(float)

In [31]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MANAGEMENT,90744.0
1,"Aaron, Jeffery M",Police Officer,POLICE,84450.0
2,"Aaron, Karina",Police Officer,POLICE,84450.0
3,"Aaron, Kimberlei R",Chief Contract Expediter,GENERAL SERVICES,89880.0
4,"Abad Jr, Vicente M",Civil Engineer Iv,WATER MANAGEMENT,106836.0

In [32]:
chicago["Employee Annual Salary"].sum()

2571506375.36

In [33]:
chicago["Employee Annual Salary"].mean()

80204.178633899

In [34]:
chicago["Employee Annual Salary"].nlargest()

8184     300000.0
7954     216210.0
25532    202728.0
8924     197736.0
8042     197724.0
Name: Employee Annual Salary, dtype: float64

In [36]:
chicago[chicago["Position Title"].str.lower().str.startswith("water")]

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,WATER MANAGEMENT,90744.0
671,"Ander, Perry A",Water Chemist Ii,WATER MANAGEMENT,82044.0
1054,"Ashley, Karma T",Water Chemist Ii,WATER MANAGEMENT,82044.0
1079,"Atkins, Joanna M",Water Chemist Ii,WATER MANAGEMENT,82044.0
1181,"Azeem, Mohammed A",Water Chemist Ii,WATER MANAGEMENT,53172.0
1285,"Bajic, John A",Water Meter Machinist,WATER MANAGEMENT,82576.0
2400,"Bolton, Brian E",Water Rate Taker,WATER MANAGEMENT,78948.0
2586,"Boyce, Adner L",Water Chemist Ii,WATER MANAGEMENT,82044.0
2745,"Brandys, Daniel",Water Chemist Ii,WATER MANAGEMENT,53172.0
3143,"Brown, Sharon L",Water Rate Taker,WATER MANAGEMENT,82728.0
3246,"Buchanan, Anthony L",Water Chemist Ii,WATER MANAGEMENT,66780.0
3456,"Burt, Carl S",Water Rate Taker,WATER MANAGEMENT,90744.0
3626,"Cage, Ophelia",Water Rate Taker,WATER MANAGEMENT,90744.0
4889,"Clark, Mark A",Water Meter Machinist,WATER MANAGEMENT,82576.0
5506,"Cooper Jr, Eddie",Water Chemist Ii,WATER MANAGEMENT,82044.0
6337,"Davenport, Clarence",Water Meter Machinist,WATER MANAGEMENT,82576.0
6954,"Diaz, Oscar A",Water Rate Taker,WATER MANAGEMENT,90744.0
7641,"Durant, Patricia B",Water Rate Taker,WATER MANAGEMENT,90744.0
7650,"Durham, Patrick L",Water Meter Machinist,WATER MANAGEMENT,82576.0
8092,"Espinosa, Rodolfo",Water Rate Taker,WATER MANAGEMENT,78948.0
10170,"Godinez, Julio A",Water Meter Machinist,WATER MANAGEMENT,82576.0
10457,"Gordon, Donald R",Water Meter Machinist,WATER MANAGEMENT,82576.0
10707,"Green, John F",Water Meter Machinist,WATER MANAGEMENT,82576.0
11857,"Hedrick, Lee A",Water Rate Taker,WATER MANAGEMENT,78948.0
12408,"Hjelmgren, James A",Water Meter Machinist,WATER MANAGEMENT,82576.0
12487,"Ho, Kwok L",Water Conservation Engineer,WATER MANAGEMENT,104748.0
12594,"Ho, Nam C",Water Chemist Ii,WATER MANAGEMENT,53172.0
12781,"Howell Jr, George B",Water Chemist Ii,WATER MANAGEMENT,66780.0
13361,"Jacob, Lovely",Water Chemist Iii,WATER MANAGEMENT,89676.0
13476,"Jansky, Thomas A",Water Meter Machinist,WATER MANAGEMENT,82576.0
...,...,...,...,...
20936,"O Connor Jr, Michael J",Water Meter Machinist,WATER MANAGEMENT,82576.0
20962,"Odibo, Grace E",Water Chemist Ii,WATER MANAGEMENT,82044.0
21078,"Olbera Sr, Martin R",Water Meter Machinist,WATER MANAGEMENT,82576.0
21212,"O Neal, Rozella",Water Meter Assessor,WATER MANAGEMENT,86580.0
21788,"Parker, Terry",Water Chemist Ii,WATER MANAGEMENT,70152.0
22384,"Pfannkuche, Joseph W",Water Meter Machinist,WATER MANAGEMENT,82576.0
22916,"Price, Johnny L",Water Meter Machinist,WATER MANAGEMENT,82576.0
23102,"Putz, Andrea R",Water Quality Manager,WATER MANAGEMENT,114552.0
23187,"Quintanilla, Edwin",Water Chemist Ii,WATER MANAGEMENT,70152.0
24003,"Rios, Francisco",Water Rate Taker,WATER MANAGEMENT,78948.0
24178,"Roberts, Akilah",Water Chemist Ii,WATER MANAGEMENT,66780.0
24266,"Robinson, Jerry",Water Meter Assessor,WATER MANAGEMENT,90744.0
24422,"Rodriguez, Edward L",Water Meter Assessor,WATER MANAGEMENT,78948.0
24501,"Rodriguez, Marco A",Water Rate Taker,WATER MANAGEMENT,90744.0
24945,"Rudmin, Kenneth D",Water Quality Inspector I/C,WATER MANAGEMENT,65172.0
25055,"Russnak, Thomas W",Water Meter Assessor,WATER MANAGEMENT,90744.0
26372,"Siddiqui, Abdurrazzaq",Water Chemist Iii,WATER MANAGEMENT,89676.0
26519,"Sims, Demetrius",Water Rate Taker,WATER MANAGEMENT,90744.0
26625,"Skowron, John",Water Rate Taker,WATER MANAGEMENT,90744.0
26871,"Smith, Nancy A",Water Rate Taker,WATER MANAGEMENT,90744.0
27015,"Sojka, Jeffrey A",Water Meter Assessor,WATER MANAGEMENT,90744.0
27635,"Stokes, Carolyn M",Water Chemist Ii,WATER MANAGEMENT,82044.0
27755,"Stroud Jr, James E",Water Meter Machinist,WATER MANAGEMENT,82576.0
28185,"Tate, Gary",Water Rate Taker,WATER MANAGEMENT,82728.0
28443,"Thomas, Howard",Water Rate Taker,WATER MANAGEMENT,78948.0
28574,"Threatt, Denise R",Water Quality Inspector,WATER MANAGEMENT,62004.0
28602,"Tignor, Darryl B",Water Rate Taker,WATER MANAGEMENT,78948.0
28955,"Travis Cook, Leslie R",Water Rate Taker,WATER MANAGEMENT,78948.0
29584,"Velazquez, John",Water Rate Taker,WATER MANAGEMENT,78948.0
30239,"Washington, Joseph",Water Chemist Iii,WATER MANAGEMENT,89676.0

In [37]:
chicago[chicago["Position Title"].str.lower().str.endswith("ist")]

,Name,Position Title,Department,Employee Annual Salary
184,"Afroz, Nayyar",Psychiatrist,HEALTH,99840.00
308,"Alarcon, Luis J",Loan Processing Specialist,COMMUNITY DEVELOPMENT,81948.00
422,"Allain, Carolyn",Senior Telecommunications Specialist,DoIT,89880.00
472,"Allen, Robert",Machinist,WATER MANAGEMENT,94328.00
705,"Anderson, Edward M",Sr Procurement Specialist,PROCUREMENT,91476.00
1022,"Arteaga, Paul",Machinist,TRANSPORTN,94328.00
1163,"Ayala Jr, Juan",Field Sanitation Specialist,STREETS & SAN,78948.00
1285,"Bajic, John A",Water Meter Machinist,WATER MANAGEMENT,82576.00
1558,"Barrett, Barbara J",Technical Training Specialist,POLICE,94200.00
1869,"Beltran, Mauricio",Procurement Specialist,PROCUREMENT,79596.00
2095,"Biggane, Thomas M",Security Specialist,CITY COUNCIL,52000.08
2319,"Bobba, Mahita",Grants Research Specialist,HEALTH,84924.00
2519,"Boston, Nathaniel K",Field Sanitation Specialist,STREETS & SAN,75384.00
2541,"Boukydis, Nikoleta N",Psychologist,HEALTH,106836.00
2634,"Boyle, Richard A",Machinist,WATER MANAGEMENT,94328.00
2678,"Bradley, Jeena",Grants Research Specialist,HEALTH,97812.00
3975,"Carlsen, John T",Psychologist,HEALTH,106836.00
4109,"Carter, Alice",Safety Specialist,WATER MANAGEMENT,86580.00
4479,"Chan, Joseph",Sr Procurement Specialist,PROCUREMENT,83340.00
4820,"Civito, John",Machinist,AVIATION,94328.00
4851,"Clarke, Daniel M",Machinist,TRANSPORTN,94328.00
4889,"Clark, Mark A",Water Meter Machinist,WATER MANAGEMENT,82576.00
5043,"Coco, Michelle T",Investigator Specialist,FIRE,91476.00
5049,"Cody, Michael J",Machinist,WATER MANAGEMENT,94328.00
5307,"Condon, Kristin",Hr Records Specialist,HUMAN RESOURCES,48852.00
5341,"Connelly, John",Machinist,WATER MANAGEMENT,94328.00
5535,"Copp, Vincent F",Psychologist,HEALTH,106836.00
5633,"Cortes, Jezieel T",Sr Procurement Specialist,PROCUREMENT,68556.00
5921,"Crump, Carolyn R",Field Sanitation Specialist,STREETS & SAN,71976.00
5938,"Cruz, Elba T",Psychologist,HEALTH,106836.00
...,...,...,...,...
26982,"Snow, Michael J",Field Sanitation Specialist,STREETS & SAN,78948.00
27209,"Spear, Richard D",Machinist,WATER MANAGEMENT,94328.00
27306,"Sriver, Nikki K",Pr Telecommunications Specialist,DoIT,98664.00
27576,"Stewart Jr, John",Sr Procurement Specialist,PROCUREMENT,83340.00
27593,"Stewart, Stacy P",Sr Procurement Specialist,PROCUREMENT,83340.00
27628,"Stockover, Thomas",Machinist,WATER MANAGEMENT,94328.00
27755,"Stroud Jr, James E",Water Meter Machinist,WATER MANAGEMENT,82576.00
27835,"Sulkes, Sheila A",Psychologist,HEALTH,106836.00
27910,"Surace, Frank V",Machinist,AVIATION,94328.00
28077,"Szymusiak, Diane",Procurement Specialist,PROCUREMENT,61584.00
28353,"Terrell, Lynnette",Sr Procurement Specialist,PROCUREMENT,87324.00
28477,"Thomas, Michael E",Rehabilitation Construction Specialist,COMMUNITY DEVELOPMENT,89880.00
28520,"Thompson, Claude O",Machinist,WATER MANAGEMENT,94328.00
28578,"Thrower, Derwin K",Safety Specialist,WATER MANAGEMENT,90744.00
29277,"Vaccaro, Joe",Machinist,AVIATION,94328.00
29310,"Valdez, Javier",Machinist,GENERAL SERVICES,94328.00
29502,"Vaughn Jr, Joseph T",Rehabilitation Construction Specialist,COMMUNITY DEVELOPMENT,81948.00
30060,"Walsh, Morag",Senior Archival Specialist,PUBLIC LIBRARY,82044.00
30156,"Ward, Sonji S",Sr Procurement Specialist,PROCUREMENT,95820.00
30287,"Watkins, Gary G",Sr Labor Relations Specialist,LAW,82668.00
30914,"Williams, Jana Y",Procurement Specialist,PROCUREMENT,58800.00
31118,"Willis, Kirk J",Crimes Surveillance Specialist,OEMC,19676.80
31296,"Wisniewski, Jerry V",Field Sanitation Specialist,STREETS & SAN,75384.00
31320,"Wittman, Elisabeth C",Archival Specialist,CITY CLERK,70152.00
31653,"Yeksigian, John P",Rehabilitation Construction Specialist,COMMUNITY DEVELOPMENT,85764.00
31667,"Yoder, Teresa G",Archival Specialist,PUBLIC LIBRARY,74304.00
31688,"Youngbloom, Laurence G",Crimes Surveillance Specialist,OEMC,19676.80
31717,"Young, Kimberly M",Sr Procurement Specialist,PROCUREMENT,68556.00
31837,"Zapata, Hugo",Sr Procurement Specialist,PROCUREMENT,87324.00
31918,"Zemke, Richard P",Machinist,AVIATION,94328.00

### More String Methods - .strip(), .lstrip() and .rstrip()

In [38]:
chicago = pd.read_csv("../data/chicago.csv").dropna(how="all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [39]:
"          Hello World     ".lstrip()

'Hello World     '

In [40]:
"          Hello World     ".rstrip()

'          Hello World'

In [41]:
"          Hello World     ".strip()

'Hello World'

In [45]:
chicago["Name"] = chicago["Name"].str.strip()

In [46]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [50]:
chicago.columns = chicago.columns.str.upper()

In [51]:
chicago.head()

,NAME,POSITION TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [56]:
chicago["NAME"].str.split(",").str.get(0).str.title()

0                 Aaron
1                 Aaron
2                 Aaron
3                 Aaron
4               Abad Jr
5                Abarca
6                Abarca
7               Abascal
8                Abbasi
9            Abbatacola
10          Abbatemarco
11               Abbate
12               Abbott
13               Abbott
14           Abbruzzese
15             Abdallah
16            Abdelhadi
17           Abdellatif
18          Abdelmajeid
19        Abdollahzadeh
20          Abdul-Karim
21             Abdullah
22             Abdullah
23             Abdullah
24             Abdullah
25          Abdulsattar
26         Abdul-Shakur
27           Abdulwahab
28              Abejero
29       Abercrombie Iv
              ...
32032         Zuniga Jr
32033            Zuniga
32034            Zuniga
32035            Zuniga
32036            Zuniga
32037            Zuniga
32038              Zuno
32039             Zupan
32040          Zupancic
32041          Zurawski
32042          Zurawski
32043          Zurawski
32044          Zurawski
32045             Zurek
32046             Zurek
32047            Zurita
32048            Zvanja
32049      Zwarycz Mann
32050           Zwarycz
32051          Zwiesler
32052              Zwit
32053           Zwolfer
32054              Zych
32055             Zydek
32056           Zygadlo
32057           Zygadlo
32058          Zygowicz
32059          Zymantas
32060         Zyrkowski
32061         Zyskowski
Name: NAME, Length: 32062, dtype: object

In [57]:
chicago["NAME"].str.split(",").str.get(0).str.title().value_counts()

Williams          293
Johnson           244
Smith             241
Brown             185
Jones             183
Rodriguez         171
Jackson           136
Garcia            130
Davis             127
Hernandez         110
Martinez          108
Lopez             106
Gonzalez          104
Perez             100
Wilson             94
Rivera             90
Thomas             89
Anderson           82
Torres             81
Murphy             80
Robinson           79
Moore              78
Harris             76
Sanchez            76
Miller             75
Lewis              74
Taylor             73
Martin             72
White              66
Clark              66
                 ...
Vasilopoulos        1
Wilczynski          1
Salamon             1
Mc Partlan          1
Hausen              1
Assaf               1
Waters Iv           1
Jiles               1
Haas                1
Sofere              1
Godfrey             1
Przewoznik          1
Shelby              1
Parriett            1
Kacija              1
Erklin              1
Harris Carlton      1
Longstreet          1
Keough              1
Kelton              1
Bland Jr            1
Bilina              1
Jessee              1
Coady               1
Uzueta              1
Koszela             1
Boey                1
Wayne               1
Abejero             1
Hidalgo             1
Name: NAME, Length: 13829, dtype: int64

In [59]:
chicago["POSITION TITLE"].str.split(" ")

0                                     [WATER, RATE, TAKER]
1                                        [POLICE, OFFICER]
2                                        [POLICE, OFFICER]
3                             [CHIEF, CONTRACT, EXPEDITER]
4                                    [CIVIL, ENGINEER, IV]
5                                [ASST, TO, THE, ALDERMAN]
6                               [GENERAL, LABORER, -, DSS]
7                          [TRAFFIC, CONTROL, AIDE-HOURLY]
8                         [STAFF, ASST, TO, THE, ALDERMAN]
9                                   [ELECTRICAL, MECHANIC]
10                                    [FIRE, ENGINEER-EMT]
11                                       [POLICE, OFFICER]
12                                   [FOSTER, GRANDPARENT]
13                                            [CLERK, III]
14                             [INVESTIGATOR, -, IPRA, II]
15                                       [POLICE, OFFICER]
16                                       [POLICE, OFFICER]
17       [FIREFIGHTER, (PER, ARBITRATORS, AWARD)-PARAME...
18                                       [POLICE, OFFICER]
19                                 [FIREFIGHTER/PARAMEDIC]
20                           [ENGINEERING, TECHNICIAN, VI]
21                                       [FIREFIGHTER-EMT]
22                                            [LIEUTENANT]
23                                       [CROSSING, GUARD]
24            [ELECTRICAL, MECHANIC-AUTO-POLICE, MTR, MNT]
25                                   [CIVIL, ENGINEER, II]
26                              [GENERAL, LABORER, -, DSS]
27                                   [FOSTER, GRANDPARENT]
28                                       [POLICE, OFFICER]
29                                             [PARAMEDIC]
                               ...
32032                                  [GARAGE, ATTENDANT]
32033                                    [POLICE, OFFICER]
32034                                    [POLICE, OFFICER]
32035                                    [POLICE, OFFICER]
32036                           [GENERAL, LABORER, -, DSS]
32037                                    [FIREFIGHTER-EMT]
32038                             [LABORER, -, APPRENTICE]
32039                                     [LIEUTENANT-EMT]
32040                                    [POLICE, OFFICER]
32041                                    [CROSSING, GUARD]
32042                 [FRM, OF, MACHINISTS, -, AUTOMOTIVE]
32043                                [SANITATION, LABORER]
32044                                    [POLICE, OFFICER]
32045                               [ELECTRICAL, MECHANIC]
32046               [SENIOR, PUBLIC, INFORMATION, OFFICER]
32047                                    [POLICE, OFFICER]
32048                                   [LEGAL, SECRETARY]
32049                                    [CROSSING, GUARD]
32050                         [POOL, MOTOR, TRUCK, DRIVER]
32051                     [AIRPORT, OPERATIONS, SUPVSR, I]
32052                                    [POLICE, OFFICER]
32053                                    [FIREFIGHTER-EMT]
32054                                    [POLICE, OFFICER]
32055                                    [POLICE, OFFICER]
32056                            [MACHINIST, (AUTOMOTIVE)]
32057                 [FRM, OF, MACHINISTS, -, AUTOMOTIVE]
32058                                    [POLICE, OFFICER]
32059                                    [POLICE, OFFICER]
32060                                    [POLICE, OFFICER]
32061                         [CHIEF, DATA, BASE, ANALYST]
Name: POSITION TITLE, Length: 32062, dtype: object

In [60]:
chicago["POSITION TITLE"].str.split(" ").str.get(0).value_counts()

POLICE                   10856
FIREFIGHTER-EMT           1509
SERGEANT                  1186
POOL                       918
FIREFIGHTER                810
CROSSING                   775
MOTOR                      721
SANITATION                 715
PARAMEDIC                  641
ASST                       606
FIRE                       512
TRAFFIC                    512
SENIOR                     470
CONSTRUCTION               452
LIEUTENANT-EMT             394
ADMINISTRATIVE             375
LIBRARY                    365
LIBRARIAN                  335
LIEUTENANT                 332
OPERATING                  324
ELECTRICAL                 313
AVIATION                   309
FIREFIGHTER/PARAMEDIC      259
GENERAL                    257
STAFF                      250
CLERK                      242
FOREMAN                    237
HOISTING                   214
DEPUTY                     213
MACHINIST                  210
                         ...
PORTFOLIO                    1
SUBPOENA                     1
CAPS                         1
DECK                         1
PHYSICIAN                    1
LOAN                         1
CURATOR                      1
MAYOR                        1
ASSOC                        1
INTAKE                       1
CRIMINALIST                  1
PURCHASING                   1
PREPRESS                     1
INDEX                        1
DENTIST                      1
SUPERINTENDENT'S             1
TELEPHONE                    1
PRINTER                      1
COMM                         1
EQUAL                        1
OFFSET                       1
MANAGER-FLEET                1
STRUCTURAL                   1
SUPERVISOR                   1
HATE                         1
MOBILE                       1
VOLUNTEER                    1
COMMANDER-PARAMEDIC          1
WARRANTY                     1
PHOTOGRAPHER                 1
Name: POSITION TITLE, Length: 320, dtype: int64

### More Practice with Splits

In [61]:
chicago = pd.read_csv("../data/chicago.csv").dropna(how="all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [65]:
chicago["Name"].str.split(",").str.get(0).value_counts().head(3)

WILLIAMS    293
JOHNSON     244
SMITH       241
Name: Name, dtype: int64

In [70]:
chicago["Name"].str.split(",").str.get(1).str.strip().str.split(" ").str.get(0).value_counts().head()

MICHAEL    1153
JOHN        899
JAMES       676
ROBERT      622
JOSEPH      537
Name: Name, dtype: int64

### The expand and n Parameters of the str.split() Method

In [72]:
chicago[["First Name", "Last Name"]] = chicago["Name"].str.split(",", expand=True)
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,AARON,KIMBERLEI R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD JR,VICENTE M

In [76]:
chicago[["First Title Word", "Remaining Words"]] = chicago["Position Title"].str.split(" ", expand=True, n=1)
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,First Name,Last Name,First Title Word,Remaining Words
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,AARON,ELVIA J,WATER,RATE TAKER
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,AARON,JEFFERY M,POLICE,OFFICER
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,AARON,KARINA,POLICE,OFFICER
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,AARON,KIMBERLEI R,CHIEF,CONTRACT EXPEDITER
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD JR,VICENTE M,CIVIL,ENGINEER IV

### MultiIndex

In [ ]:
chicago = pd.read_csv("../data/chicago.csv").dropna(how="all")
chicago["Department"] = chicago["Department"].astype("category")
chicago.head()